
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>量化方式 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="standard.html" />
    
    
    <link rel="prev" href="pointcut.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    第一章 概念
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../chapter1/definition.html">
            
                <a href="../chapter1/definition.html">
            
                    
                    性能优化的定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../chapter1/meaningful.html">
            
                <a href="../chapter1/meaningful.html">
            
                    
                    性能优化的意义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../chapter1/viewpoint.html">
            
                <a href="../chapter1/viewpoint.html">
            
                    
                    性能优化的分类
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    第二章 量化
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="pointcut.html">
            
                <a href="pointcut.html">
            
                    
                    量化角度
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="pathway.html">
            
                <a href="pathway.html">
            
                    
                    量化方式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="standard.html">
            
                <a href="standard.html">
            
                    
                    衡量标准
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <span>
            
                    
                    第三章 优化
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="../chapter3/native.html">
            
                <a href="../chapter3/native.html">
            
                    
                    客户端优化方式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="../chapter3/frontend.html">
            
                <a href="../chapter3/frontend.html">
            
                    
                    前端优化方式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="../chapter3/service.html">
            
                <a href="../chapter3/service.html">
            
                    
                    服务端优化方式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.4" data-path="../chapter3/summary.html">
            
                <a href="../chapter3/summary.html">
            
                    
                    实践小结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.2" >
            
                <span>
            
                    
                    第四章 体系
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.2.1" data-path="../chapter4/construction.html">
            
                <a href="../chapter4/construction.html">
            
                    
                    整体结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.2" data-path="../chapter4/safeguard.html">
            
                <a href="../chapter4/safeguard.html">
            
                    
                    保障措施
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >量化方式</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x91CF;&#x5316;&#x65B9;&#x5F0F;">&#x91CF;&#x5316;&#x65B9;&#x5F0F;</h1>
<p>&#x4E86;&#x89E3;&#x91CF;&#x5316;&#x89D2;&#x5EA6;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x91CF;&#x5316;&#x6027;&#x80FD;&#x7684;&#x5207;&#x5165;&#x70B9;&#xFF0C;&#x4E0B;&#x9762;&#x7EE7;&#x7EED;&#x4ECE;&#x6837;&#x672C;&#x91C7;&#x96C6;&#x548C;&#x6837;&#x672C;&#x5F52;&#x96C6;&#x4E24;&#x4E2A;&#x89D2;&#x5EA6;&#x8BB2;&#x8FF0;&#x91CF;&#x5316;&#x65B9;&#x5F0F;&#x3002;</p>
<h2 id="&#x6837;&#x672C;&#x91C7;&#x96C6;">&#x6837;&#x672C;&#x91C7;&#x96C6;</h2>
<p>&#x4ECE;<code>&#x91CF;&#x5316;&#x89D2;&#x5EA6;</code>&#x8FD9;&#x4E00;&#x5C0F;&#x8282;&#x4E2D;&#x77E5;&#x9053;&#x6837;&#x672C;&#x91CF;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x7EDF;&#x8BA1;&#x56E0;&#x7D20;&#xFF0C;&#x56E0;&#x6B64;&#x6837;&#x672C;&#x91C7;&#x96C6;&#x5DE5;&#x4F5C;&#x5C31;&#x663E;&#x5F97;&#x5C24;&#x4E3A;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x4E0E;&#x5176;&#x4ED6;&#x524D;&#x7AEF;&#x9875;&#x9762;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;App&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5177;&#x5907;&#x5BA2;&#x6237;&#x7AEF;&#x7248;&#x672C;+&#x524D;&#x7AEF;Bundle&#x7248;&#x672C;&#x7684;&#x7ED3;&#x5408;&#x4F53;&#xFF0C;&#x6837;&#x672C;&#x7684;&#x91C7;&#x96C6;&#x5DE5;&#x4F5C;&#x4F1A;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x3002;</p>
<h3 id="&#x91C7;&#x96C6;&#x6307;&#x6807;">&#x91C7;&#x96C6;&#x6307;&#x6807;</h3>
<p>&#x9274;&#x4E8E;&#x7248;&#x672C;&#x8FD9;&#x4E2A;&#x7279;&#x6B8A;&#x6027;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x91C7;&#x96C6;&#x7684;&#x4F0A;&#x59CB;&#x5C31;&#x9700;&#x8981;&#x786E;&#x5B9A;&#x597D;&#x5BF9;&#x5E94;&#x7684;&#x91C7;&#x96C6;&#x6307;&#x6807;&#xFF0C;&#x4E14;&#x5E76;&#x4E0D;&#x968F;&#x7740;&#x7248;&#x672C;&#x7684;&#x66F4;&#x8FED;&#x51FA;&#x73B0;&#x6307;&#x6807;&#x9879;&#x4E0A;&#x7684;&#x53D8;&#x5316;&#x3002;
&#x5728;<code>&#x6027;&#x80FD;&#x4F18;&#x5316;&#x7684;&#x5B9A;&#x4E49;</code>&#x8FD9;&#x4E00;&#x5C0F;&#x8282;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;React Native&#x7684;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;FP&#x3001;FCP&#x3001;FMP&#x4E0E;TTI&#x8FD9;&#x4E9B;&#x6307;&#x6807;&#x9879;&#x90FD;&#x5177;&#x5907;&#x91C7;&#x96C6;&#x7684;&#x5FC5;&#x8981;&#x6027;&#xFF0C;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x4E0B;&#x8FF0;&#x573A;&#x666F;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#xFF1A;</p>
<ul>
<li>FP&#xFF1A;&#x767D;&#x5C4F;&#x7ED3;&#x675F;&#x65F6;&#x95F4;&#x70B9;</li>
<li>FCP&#xFF1A;&#x9875;&#x9762;&#x5F00;&#x59CB;&#x6E32;&#x67D3;&#x65F6;&#x95F4;&#x70B9;</li>
<li>FMP&#xFF1A;&#x9875;&#x9762;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x51FA;&#x73B0;&#x65F6;&#x95F4;&#x70B9;</li>
<li>TTI&#xFF1A;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x5B8C;&#x6BD5;&#x65F6;&#x95F4;&#x70B9;</li>
</ul>
<h3 id="&#x91C7;&#x96C6;&#x65B9;&#x5F0F;">&#x91C7;&#x96C6;&#x65B9;&#x5F0F;</h3>
<p>&#x901A;&#x8FC7;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x524D;&#x7AEF;&#x5E95;&#x5C42;&#x6846;&#x67B6;&#x4E2D;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x65F6;&#x673A;&#x70B9;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x57CB;&#x70B9;&#x4E0A;&#x62A5;&#x5B8C;&#x6210;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E0A;&#x62A5;&#x7684;&#x4FE1;&#x606F;&#x9664;&#x4E86;&#x6307;&#x6807;&#x9879;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x7528;&#x6237;&#x8BBE;&#x5907;&#x4FE1;&#x606F;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x524D;&#x7AEF;Bundle&#x7248;&#x672C;&#x4FE1;&#x606F;&#x7B49;&#x8BC6;&#x522B;&#x7C7B;&#x4FE1;&#x606F;&#xFF0C;&#x7528;&#x4E8E;&#x5728;&#x6837;&#x672C;&#x5F52;&#x96C6;&#x9636;&#x6BB5;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x5176;&#x4E2D;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#x7684;&#x6307;&#x6807;&#x9879;&#x91C7;&#x96C6;&#x65B9;&#x5F0F;&#x662F;TTI&#xFF0C;&#x7531;&#x4E8E;&#x6BCF;&#x4E00;&#x6B21;&#x7684;<code>setState</code>&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x89E6;&#x53D1;&#x4E00;&#x6B21;&#x9875;&#x9762;&#x6E32;&#x67D3;&#xFF0C;&#x800C;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x52A0;&#x8F7D;&#x7684;&#x5185;&#x5BB9;&#x4E0D;&#x540C;&#xFF0C;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x5B8C;&#x6BD5;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x4ECE;&#x4EE3;&#x7801;&#x5C42;&#x9762;&#x7EDF;&#x4E00;&#x57CB;&#x70B9;&#x6536;&#x53E3;&#x5904;&#x7406;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x9875;&#x9762;&#x50CF;&#x7D20;&#x68C0;&#x6D4B;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x9875;&#x9762;&#x50CF;&#x7D20;&#x68C0;&#x6D4B;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x56FE;&#x50CF;&#x6BD4;&#x5BF9;&#x7684;&#x4E00;&#x79CD;&#x5E94;&#x7528;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x8F83;&#x524D;&#x540E;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#x53D8;&#x5316;&#x6765;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x5B58;&#x5728;&#x9875;&#x9762;&#x91CD;&#x7ED8;/&#x5237;&#x65B0;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x7531;&#x4E8E;&#x9875;&#x9762;&#x50CF;&#x7D20;&#x68C0;&#x6D4B;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x6574;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x5BB9;&#x6613;&#x5C06;&#x9875;&#x9762;&#x4E2D;&#x67D0;&#x5757;&#x56FA;&#x5B9A;&#x7684;&#x90E8;&#x5206;&#x8BA4;&#x5B9A;&#x4E3A;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x91CD;&#x7ED8;/&#x5237;&#x65B0;&#xFF0C;&#x4ECE;&#x800C;&#x9020;&#x6210;&#x8BE5;&#x6307;&#x6807;&#x91C7;&#x6837;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x8BE5;&#x60C5;&#x51B5;&#xFF0C;&#x53EF;&#x4EE5;&#x4F9D;&#x636E;&#x9875;&#x9762;&#x7684;&#x6E32;&#x67D3;&#x5185;&#x5BB9;&#x7279;&#x5F81;&#x6765;&#x9009;&#x53D6;&#x65E0;&#x9700;&#x505A;&#x50CF;&#x7D20;&#x68C0;&#x6D4B;&#x7684;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x5FFD;&#x7565;&#x65E0;&#x9700;&#x68C0;&#x6D4B;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x63D0;&#x9AD8;&#x91C7;&#x96C6;&#x6837;&#x672C;&#x7684;&#x51C6;&#x786E;&#x7387;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x4E2D;&#x7EA2;&#x6846;&#x6240;&#x793A;&#x90E8;&#x5206;&#x4F5C;&#x4E3A;&#x68C0;&#x6D4B;&#x533A;&#x57DF;&#xFF0C;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4E0D;&#x5C5E;&#x4E8E;&#x68C0;&#x6D4B;&#x8303;&#x56F4;&#x3002;</p>
<p><img src="https://s3.ax1x.com/2021/01/22/sI6Or8.png" style="zoom:50%"></p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x7531;&#x4E8E;&#x9875;&#x9762;&#x95F4;&#x4E1A;&#x52A1;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x9875;&#x9762;&#x50CF;&#x7D20;&#x68C0;&#x6D4B;&#x7684;API&#xFF0C;&#x4FBF;&#x4E8E;&#x63A5;&#x5165;&#x65B9;&#x66F4;&#x7CBE;&#x51C6;&#x63D0;&#x4F9B;&#x5224;&#x65AD;&#x533A;&#x57DF;&#x3002;</p>
<h2 id="&#x6837;&#x672C;&#x5F52;&#x96C6;">&#x6837;&#x672C;&#x5F52;&#x96C6;</h2>
<p>&#x91C7;&#x96C6;&#x5230;&#x4E00;&#x5B9A;&#x91CF;&#x7684;&#x6837;&#x672C;&#x6570;&#x636E;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x91C7;&#x96C6;&#x5230;&#x7684;&#x6837;&#x672C;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5F52;&#x7C7B;&#x5904;&#x7406;&#x3002;&#x76EE;&#x7684;&#x662F;&#x4ECE;&#x591A;&#x7EF4;&#x5EA6;&#x591A;&#x6307;&#x6807;&#x5730;&#x5F97;&#x51FA;&#x91CF;&#x5316;&#x6570;&#x636E;&#xFF0C;&#x4E3A;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x7684;&#x8FED;&#x4EE3;&#x6548;&#x679C;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x652F;&#x6491;&#x3002;</p>
<p>&#x6837;&#x672C;&#x5F52;&#x96C6;&#x65B9;&#x9762;&#x4E3B;&#x8981;&#x4EE5;&#x6307;&#x6807;&#x7EF4;&#x5EA6;&#x548C;&#x5E73;&#x53F0;&#x7EF4;&#x5EA6;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x8BF4;&#x660E;&#xFF0C;&#x4E86;&#x89E3;&#x540E;&#x5C06;&#x5BF9;React Native&#x7684;&#x91CF;&#x5316;&#x8C03;&#x4F18;&#x6570;&#x636E;&#x6709;&#x4E00;&#x5B9A;&#x4E86;&#x89E3;&#xFF0C;&#x4E3A;&#x540E;&#x7EED;&#x8C03;&#x4F18;&#x8FC7;&#x7A0B;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#x3002;</p>
<h3 id="&#x6307;&#x6807;&#x7EF4;&#x5EA6;">&#x6307;&#x6807;&#x7EF4;&#x5EA6;</h3>
<p>&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x4EE5;&#x4E0D;&#x540C;&#x6307;&#x6807;&#x9879;&#x4E3A;&#x7EF4;&#x5EA6;&#x8FDB;&#x884C;&#x7684;&#x6837;&#x672C;&#x5904;&#x7406;&#x3002;&#x8BE5;&#x7EF4;&#x5EA6;&#x7684;&#x5904;&#x7406;&#x7ED3;&#x679C;&#x5C06;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x5206;&#x4E3A;&#x4E0D;&#x540C;&#x9636;&#x6BB5;&#xFF0C;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x9636;&#x6BB5;&#x7684;&#x6307;&#x6807;&#x9879;&#xFF0C;&#x8C03;&#x4F18;&#x7684;&#x65B9;&#x5F0F;&#x4E5F;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;&#x3002;</p>
<p>&#x4ECE;&#x6E32;&#x67D3;&#x7684;&#x603B;&#x4F53;&#x6D41;&#x7A0B;&#x6765;&#x770B;&#xFF0C;FP&#x4F5C;&#x4E3A;&#x4E00;&#x7C7B;&#x3001;FCP&#x4E0E;FMP&#x4F5C;&#x4E3A;&#x4E00;&#x7C7B;&#x3001;TTI&#x4F5C;&#x4E3A;&#x4E00;&#x7C7B;&#xFF0C;&#x8FD9;&#x6837;&#x5207;&#x5206;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x4E86;&#x9875;&#x9762;&#x6E32;&#x67D3;&#x7684;&#x4E0D;&#x540C;&#x9636;&#x6BB5;&#x3002;</p>
<ul>
<li>FP&#x9636;&#x6BB5;&#x65F6;&#xFF0C;&#x9875;&#x9762;&#x5185;&#x5BB9;&#x4E00;&#x7247;&#x7A7A;&#x767D;&#xFF0C;&#x8BE5;&#x9636;&#x6BB5;&#x8017;&#x65F6;&#x4E3B;&#x8981;&#x7531;&#x4E8E;App&#x7AEF;&#x9700;&#x8981;&#x52A0;&#x8F7D;Bundle&#x5305;&#x5BFC;&#x81F4;&#xFF1B;</li>
<li>FCP&#x4E0E;FMP&#x9636;&#x6BB5;&#x65F6;&#xFF0C;&#x9875;&#x9762;&#x5F00;&#x59CB;&#x6E32;&#x67D3;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x4E0D;&#x53EF;&#x4EA4;&#x4E92;&#xFF0C;&#x8BE5;&#x9636;&#x6BB5;&#x8017;&#x65F6;&#x4E3B;&#x8981;&#x7531;&#x4E8E;&#x4E00;&#x4E9B;&#x5FC5;&#x987B;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#x5BFC;&#x81F4;&#xFF1B;</li>
<li>TTI&#x9636;&#x6BB5;&#x65F6;&#xFF0C;&#x9875;&#x9762;&#x5185;&#x5BB9;&#x53EF;&#x4EA4;&#x4E92;&#xFF0C;&#x8BE5;&#x9636;&#x6BB5;&#x8017;&#x65F6;&#x662F;&#x7531;&#x4E8E;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x6570;&#x636E;&#x8BF7;&#x6C42;&#x8FD4;&#x56DE;&#x6216;&#x5176;&#x4ED6;&#x524D;&#x5E8F;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x5BFC;&#x81F4;&#x3002;</li>
</ul>
<p>&#x5206;&#x9636;&#x6BB5;&#x5BF9;&#x91CF;&#x5316;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5F52;&#x96C6;&#x540E;&#xFF0C;&#x91C7;&#x7528;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x5206;&#x6790;&#x4E0D;&#x540C;&#x9636;&#x6BB5;&#x7684;&#x6570;&#x636E;&#x6307;&#x6807;&#xFF0C;&#x8BA9;&#x6BCF;&#x4E00;&#x6B21;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x90FD;&#x6709;&#x6570;&#x636E;&#x53EF;&#x4F9D;&#x3002;</p>
<h3 id="&#x5E73;&#x53F0;&#x7EF4;&#x5EA6;">&#x5E73;&#x53F0;&#x7EF4;&#x5EA6;</h3>
<p>React Native&#x652F;&#x6301;&#x53CC;&#x5E73;&#x53F0;&#xFF0C;&#x4F46;&#x5728;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x4E0A;&#x7684;&#x5B9E;&#x9645;&#x6027;&#x80FD;&#x5374;&#x662F;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5305;&#x62EC;&#x5404;&#x7C7B;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x7684;&#x65B9;&#x5F0F;&#x548C;&#x7ED3;&#x679C;&#x4F1A;&#x51FA;&#x73B0;&#x8BB8;&#x591A;&#x5DEE;&#x5F02;&#x6027;&#x3002;</p>
<p>&#x6B63;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x5DEE;&#x5F02;&#x6027;&#xFF0C;&#x6309;&#x5E73;&#x53F0;&#x7EF4;&#x5EA6;&#x53BB;&#x5F52;&#x96C6;&#x91CF;&#x5316;&#x7684;&#x6837;&#x672C;&#x6570;&#x636E;&#x6210;&#x4E3A;&#x4E86;&#x5FC5;&#x9700;&#x54C1;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F1A;&#x5C06;&#x53CC;&#x5E73;&#x53F0;&#x7684;&#x6570;&#x636E;&#x5206;&#x5F00;&#x5F52;&#x96C6;&#x540E;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x53BB;&#x505A;&#x9488;&#x5BF9;&#x6027;&#x5F97;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;React Native&#x7684;JS&#x6E32;&#x67D3;&#x5F15;&#x64CE; Hermes&#x53EA;&#x80FD;&#x8FD0;&#x7528;&#x5728;Android&#x5E73;&#x53F0;&#xFF0C;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4ECE;&#x8C03;&#x4F18;&#x65B9;&#x5F0F;&#x5F00;&#x59CB;&#x51B3;&#x5B9A;&#x4E86;&#x8C03;&#x4F18;&#x7684;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x548C;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x5728;&#x533A;&#x5206;&#x53CC;&#x5E73;&#x53F0;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x5E73;&#x53F0;&#x7684;&#x91CF;&#x5316;&#x6570;&#x636E;&#x9700;&#x8981;&#x5728;&#x5F52;&#x96C6;&#x65F6;&#x5212;&#x5B9A;&#x4E0D;&#x540C;&#x7684;&#x6027;&#x80FD;&#x533A;&#x57DF;&#xFF0C;&#x5982;&#x201C;0-0.5s&#x3001;0.5-1s&#x201D;&#x5206;&#x5E03;&#x5F0F;&#x5F97;&#x5C55;&#x793A;&#x6027;&#x80FD;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><a href="https://imgchr.com/i/sI7UYV" target="_blank"><img src="https://s3.ax1x.com/2021/01/22/sI7UYV.png" alt="sI7UYV.png"></a></p>
<p>&#x91C7;&#x7528;&#x8BE5;&#x79CD;&#x65B9;&#x5F0F;&#x5C55;&#x793A;&#x7684;&#x4F18;&#x52BF;&#x662F;&#x53EF;&#x4EE5;&#x76F4;&#x89C2;&#x5F97;&#x770B;&#x5230;&#x91CF;&#x5316;&#x540E;&#x7684;&#x6027;&#x80FD;&#x6570;&#x636E;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#xFF0C;&#x5176;&#x91CF;&#x5316;&#x7684;&#x6027;&#x80FD;&#x6570;&#x636E;&#x5F80;&#x5F80;&#x5448;&#x73B0;&#x51FA;&#x6B63;&#x6001;&#x5206;&#x5E03;&#x7684;&#x6001;&#x52BF;&#xFF0C;&#x5F53;&#x7136;&#x968F;&#x7740;&#x673A;&#x578B;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#x7684;&#x5DEE;&#x5F02;&#x6027;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x957F;&#x5C3E;&#x6548;&#x5E94;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x67D0;&#x4E00;&#x7279;&#x5B9A;&#x533A;&#x57DF;&#xFF08;&#x5982;&#x957F;&#x5C3E;&#x90E8;&#x5206;&#xFF09;&#x7684;&#x6027;&#x80FD;&#x6570;&#x636E;&#xFF0C;&#x5206;&#x6790;&#x5176;&#x5F62;&#x6210;&#x539F;&#x56E0;&#xFF0C;&#x5C06;&#x66F4;&#x5BB9;&#x6613;&#x5236;&#x5B9A;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x8C03;&#x4F18;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x5728;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x7684;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x7684;&#x91CD;&#x8981;&#x91CF;&#x5316;&#x6307;&#x9488;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="pointcut.html" class="navigation navigation-prev " aria-label="Previous page: 量化角度">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="standard.html" class="navigation navigation-next " aria-label="Next page: 衡量标准">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"量化方式","level":"1.3.2","depth":2,"next":{"title":"衡量标准","level":"1.3.3","depth":2,"path":"chapter2/standard.md","ref":"chapter2/standard.md","articles":[]},"previous":{"title":"量化角度","level":"1.3.1","depth":2,"path":"chapter2/pointcut.md","ref":"chapter2/pointcut.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter2/pathway.md","mtime":"2021-02-04T09:10:38.675Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-04T11:01:20.950Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

